{
  "title": "Data Analysis Tools",
  "launchTool": "Launch Tool",
  "sam": {
    "title": "SAM (Significance Analysis of Microarray)",
    "whatIsIt": {
      "title": "What is it?",
      "content": "SAM is a method used for large-scale gene or protein expression data like those collected with microarrays. It addresses the issue of analyzing large-scale data in which a microarray experiment of 10,000 proteins would identify 100 proteins by chance using a p-value cut-off of 0.01. Therefore, SAM applies a t-test at the individual gene or protein level to determine whether the expression pattern for that gene or protein is significant."
    },
    "whenIsItUsed": {
      "title": "When is it used?",
      "content": "This test is performed when the samples 1) may not be independent of each other and 2) are or are not normally distributed. It can help identify expression patterns that have little difference between the control and test groups but are nevertheless significant."
    },
    "howDoesItWork": {
      "title": "How does it work?",
      "example": {
        "title": "SAM Example",
        "description": "We want to find serological proteins that are different between 12 healthy and 12 diseased patients using an antibody-based microarray targeting 1,000 proteins."
      },
      "steps": [
        "The observed relative difference per protein across groups is determined, which considers the mean and variance of each group. This step accounts for protein-specific fluctuations.",
        "The expected relative difference per protein across groups is determined by averaging the protein responses across numerous permutations. Random permutations form a simulated distribution of expected relative differences (like a t-statistic).",
        "Plot the observed vs expected relative difference. This is a visual way of looking at the data.",
        "Identify proteins-of-interest that deviate from the diagonal line using a threshold. The threshold is determined by calculating false discovery rates (FDRs) using data from the permutations.",
        "Determine the statistical significance of the proteins-of-interest. Biomarkers with larger deviations between the observed and expected relative difference are deemed significant."
      ]
    },
    "dataLookLike": {
      "title": "What does the data look like?",
      "content": "For each gene or protein, SAM produces a test statistic value based upon the observed value’s deviation from the expected value. Unlike other models that use a p-value or FDR, SAM determines significance based on the deviation of the observed data from the expected value; the expected value is based on numerous permutations of the original data."
    }
  },
  "bapcp": {
    "title": "BAPCP (Biomarker Analysis tool for Protein Chip Platforms)",
    "whatIsIt": {
      "title": "What is it?",
      "content": "BAPCP is a comprehensive web-based platform designed specifically for the analysis of protein microarray data. It streamlines the process of identifying biomarkers by integrating standard GenePix Results (.gpr) files and providing a user-friendly interface for complex statistical analyses."
    },
    "capabilities": {
      "title": "Key Capabilities",
      "content": "It offers a robust suite of tools including 7 different normalization methods to correct for systematic variation, and 7 distinct quality control and differential analysis filters. These features allow researchers to confidently extract meaningful biomarkers from experimental groups."
    },
    "workflow": {
      "title": "How does it work?",
      "steps": [
        "Data Upload: Users upload .gpr, .xls, or .csv files for multiple experimental conditions.",
        "Preprocessing: Select from normalization methods like Quantile or RobustScaler to align signal distributions.",
        "Analysis: Apply statistical tests and filters to identify differentially expressed proteins.",
        "Visualization: Generate interactive box plots, heatmaps, and volcano plots to visualize the results."
      ]
    }
  },
  "pcp": {
    "title": "PCP (Protein Chip Platform)",
    "whatIsIt": {
      "title": "What is it?",
      "content": "The Protein Chip Platform (PCP) is a versatile analysis tool tailored for protein microarray studies. It focuses on providing a flexible environment for data normalization, filtering, and statistical testing, making it easier to compare experimental and control groups."
    },
    "capabilities": {
      "title": "Key Capabilities",
      "content": "PCP supports a wide range of normalization techniques (Median, Mean, Quantile) and statistical tests (T-test, U-test). It also includes advanced filtering options based on signal intensity, Coefficient of Variation (CV), and Z-scores to ensure high-quality data analysis."
    },
    "workflow": {
      "title": "How does it work?",
      "steps": [
        "Input: Upload raw data files for experimental and control groups.",
        "Configuration: Choose specific fields to analyze (e.g., F650 Median) and apply background correction.",
        "Normalization: Apply mathematical transformations to normalize the data across chips.",
        "Statistical Testing: Run T-tests or U-tests to determine statistical significance and identify potential targets."
      ]
    }
  }
}
